{
  "metadata": {
    "title": "Utah State Standards for P–12 English Language Arts",
    "publisher": "Utah State Board of Education",
    "date": "May 2023",
    "pages": 62,
    "source": "-English Language Arts Standards.pdf",
    "notes": "Headers/footers removed per user instruction; page markers included as digits."
  },
  "pages": [
    {
      "page": 1,
      "text": "ENGLISH \nLANGUAGE  ARTSMay 2023"
    },
    {
      "page": 2,
      "text": "This is a blank page."
    },
    {
      "page": 3,
      "text": "for\nP–12 ENGLISH\nLANGUAGE ARTS\nAdopted May 2023\nby the \n250 East 500 South\nP .O. Box 144200\nSalt Lake City, UT 841 14-4200\nSydnee  Dickson, Ed.D.\nState Superintendent of Public Instruction"
    },
    {
      "page": 4,
      "text": "This is a blank page."
    },
    {
      "page": 5,
      "text": "OF EDUCATION\n250 East 500 South   P. O. Box 144200   Salt Lake City, UT  84114-4200\nDistrict  Name  City\nDistrict 1  Jennie L. Earl  Morgan, UT\nDistrict 2  Joseph Kerry  Ogden, UT\nDistrict 3  Brent Strate  South Ogden, UT\nDistrict 4  Leann Wood  Kaysville, UT\nDistrict 5  Sarah Reale  Salt Lake City, UT\nDistrict 6  Carol Barlow Lear  Salt Lake City, UT\nDistrict 7  Molly Hart  Sandy, UT\nDistrict 8  Christina Boggess  Taylorsville, UT\nDistrict 9  Natalie Cline  Bluffdale, UT\nDistrict 10  Matt Hymas  Magna, UT\nDistrict 11  Cindy Davis  Cedar Hills, UT\nDistrict 12  James Moss Jr.  Midway, UT\nDistrict 13  Randy Boothe  Spanish Fork, UT\nDistrict 14  Emily Green  Cedar City, UT\nDistrict 15  Kristan Norton  St. George, UT\n Sydnee Dickson  State Superintendent\n  of Public Instruction\n Cybil Child  Secretary to the Board\n1/2023"
    },
    {
      "page": 6,
      "text": ""
    },
    {
      "page": 7,
      "text": "INTRODUCTION     .   .   .   .   .   .   .   .   .   .   .   .   .   .   ix\nStandards: PRESCHOOL–AGE 3     .   .   .   .   .   .   .   .   .   .1\nStandards: PRESCHOOL–AGE 4     .   .   .   .   .   .   .   .   .   .4\nStandards: KINDERGARTEN .   .   .   .   .   .   .   .   .   .   .   .7\nStandards: GRADE 1    .   .   .   .   .   .   .   .   .   .   .   .   .10\nStandards: GRADE 2    .   .   .   .   .   .   .   .   .   .   .   .   .13\nStandards: GRADE 3    .   .   .   .   .   .   .   .   .   .   .   .   .17\nStandards: GRADE 4    .   .   .   .   .   .   .   .   .   .   .   .   .21\nStandards: GRADE 5    .   .   .   .   .   .   .   .   .   .   .   .   .25\nStandards: GRADE 6    .   .   .   .   .   .   .   .   .   .   .   .   .29\nStandards: GRADES 7–8   .   .   .   .   .   .   .   .   .   .   .   .  33\nStandards: GRADES 9–10     .   .   .   .   .   .   .   .   .   .   .   37\nStandards: GRADES 11–12   .   .   .   .   .   .   .   .   .   .   .  42"
    },
    {
      "page": 8,
      "text": ""
    },
    {
      "page": 9,
      "text": "Utah educators in 2022 to identify the key literacy standards necessary for Utah students to master by the end of each grade level. Some standards are mastered in previous grades. If a student has not mastered previous grade-level standards, the teacher will need to intervene in order to fill the student's skill gaps.\nOrganization \ncant areas of learning within content areas. In ELA, these strands are speaking and listening, reading, and writing.\nWithin each strand are standards. All standards are considered essential to \nmaster. The skills in the standards require repeated exposure with increasingly \ncomplex texts and in increasingly sophisticated contexts. Mastery is only ob -\ntained by regular practice over time. \nShifts in the Standards\nChanges in the standards were made to improve the consistency and practicality of the standards. These changes include:\n ]The standards were reduced, simplified, and clarified.\n ]Phonological Awareness was added in grades 2 and 3.\n ]The Reading Literature (RL) and Reading Informational (RI) standards were combined where it was most logical.\n ]The language strand of standards was woven throughout the speaking and listening, reading, and writing strands.\n ]Much like 9–10 and 11–12, 7th and 8th grade standards were banded. \n ]References to specific texts were removed from the standards in an ef -\nfort to broaden representation and enhance local control over curricular choices.\nSpeaking and Listening Strand\nThe following standards offer a focus for speaking and listening instruction each year to help ensure that students gain adequate mastery of a range of skills and applications. Students develop useful interpersonal skills for the classroom and workplace by having the opportunity to listen to each other, respond appro -\npriately, and evaluate what they hear from a variety of sources. The standards stress preparing for and participating effectively in a range of conversations and collaborations. Students advancing through the grades are expected to meet each year’s grade-specific standards and retain or further develop skills and un -"
    },
    {
      "page": 10,
      "text": "munication and interpersonal skills. Young students may master acquisition of \ncertain speech sounds at different ages. The chart below includes the typical age of acquisition of each sound.\nSpeech Development Progression Chart \n(age in years)\n2 3 4 5 6 7 8\n/p/ as in \npop\n/m/ as in \nmet\n/h/ as in \nhot\n/n/ as in \nno\n/w/ as in \nwill\n/b/ as in \nbook\n/k/ as in \ncab\n/g/ as in \ngot\n/d/ as in \ndock\n/t/ as in \ntap\n/ng/ as \nin sing\n/f/ as in \nfill/reef\n/y/ as in \nyou\n/r/ as in \nred\n/l/ as in \nleak/hill\n/s/ as in \nsun"
    },
    {
      "page": 11,
      "text": "/ch/ as \nin chop\n/sh/ as \nin shock\n/z/ as in \nzoom\n/j/ as in \njump\n/v/ as in \nvan\n/th/ as in \nthink\n/th/ as in \nthe\n/zh/ as \nin beige\nAdapted from Sander (1972), Grunwell (1981), and Smit et al. (1990)\nReading Strand\nThe following reading standards offer a focus for reading instruction while build -\ning core knowledge and deepening comprehension. Students advancing through \nthe grades are expected to meet each year’s grade-specific standards and retain or further develop skills and understandings mastered in preceding grades by reading increasingly complex texts throughout the grades. Texts should reflect a variety of genres, time periods, topics, perspectives, cultures, and backgrounds. Reading standards include reading literature and reading informational texts. Reading Literature is indicated with (RL) and Reading Informational with (RI). \nThe Reading Strand includes the foundational skills in the primary grades. These \nfoundational skills are not an end in and of themselves. Rather, they are neces -\nsary and important components of effective, evidence-based reading instruction to develop reading proficiency with the capacity to comprehend texts across a range of types and disciplines. Some readers will need more or less practice with these foundational skills than other readers. The point is to teach students what \nthey need to learn in order to be successful, proficient readers.  \nAn important part of comprehensive reading instruction is that students acquire knowledge of language, particularly in using accurate academic and domain-spe -\ncific words and phrases, sufficient for reading, writing, speaking, and listening. Thus, the reading standards weave in language standards focused on vocabulary"
    },
    {
      "page": 12,
      "text": "dence as readers and writers when considering a word or phrase important to \ncomprehension.   \nStudents must also be immersed in reading challenging, complex texts to ac -\ntively make meaning, answer questions, solve problems, and craft arguments. \nText complexity includes qualitative features of text and a range of texts within the quantitative grade band and associated Lexile ranges. Standard R.4 includes an asterisk to refer educators back to the Text Complexity Grade Bands and Associated Lexile Ranges below. \nText Complexity Grade Bands and Associated Lexile Ranges\nText Complexity \nGrade BandLexile Range\nK–1 N/A\n2–3 450–790\n4–5 770–980\n6–8 955–1155\n9–10 1080–1305\n11–12 1215–1355\nEngaging students in deep discussions and writing of texts is imperative to their growth and development as readers. Writing and discussion of text focuses on key ideas and details, craft and structure, and integrating knowledge and ideas. Students then need to return to previously-read texts to compare with other texts and synthesize the information from multiple texts for presentations, proj -\nects, or additional writing.  \nWriting Strand\nThe following standards offer a focus for writing instruction to ensure that stu -\ndents gain adequate mastery of a range of writing skills and applications to ad -\ndress increasingly demanding content and sources. Students advancing through the grades are expected to meet each year’s grade-specific standards and re -\ntain or further develop skills and understandings mastered in preceding grades. Students’ production of writing should focus more on content and ideas rather than on length. Therefore, length requirements per grade are not included in the standards. \nStudents will learn to research, plan, draft, revise, edit, and publish. These \nskills are applicable to many types of writing such as opinion, argumentative, informative, explanatory, and narrative. The standards stress the importance of the reading-writing connection by requiring students to draw upon and"
    },
    {
      "page": 13,
      "text": "expectations."
    },
    {
      "page": 14,
      "text": ""
    },
    {
      "page": 15,
      "text": "Strand 1:  SPEAKING AND LISTENING (P3.SL)\nStudents will learn to collaborate, express and listen to ideas, integrate \nand evaluate information from various sources, use media and visual displays as well as language and grammar strategically to help achieve communicative purposes, and adapt to context and task.\nStandard P3.SL.1:   With prompting and support, participate in conversations\nwith peers and adults.\na.Begin to recognize rules for discussion such as listening to\nothers, staying on topic, and taking turns speaking.\nb.Follow one-step directions.\nStandard P3.SL.2:   With prompting and support, speak clearly and audibly\nenough to be understood by familiar adults to communicate wants and needs.\nStandard P3.SL.3:   With prompting and support, use age-appropriate language,\ngrammar, volume, and pronunciation when speaking or presenting.\nStrand 2:\n READING (P3.R) \nStudents will learn to proficiently read and comprehend grade-level literature and informational text, including seminal U.S. documents of historical and literary significance, at the high end of the grade-level text complexity band, with scaffolding as needed. *Standard R.4 includes an \nasterisk to refer educators back to the Text Complexity Grade Bands and As -\nsociated Lexile Ranges in the introduction of the standards.\nStandard P3.R.1:   Demonstrate mastery of age-appropriate concepts of print.\na.With prompting and support, correctly hold a book and\nrecognize that print is read from top to bottom, left toright, and from front to back.\nb.With prompting and support, begin to recognize frequent -\nly seen letters and words, and recognize own name inprint.\nStandard P3.R.2:   Demonstrate mastery of age-appropriate phonological\nawareness skills."
    },
    {
      "page": 16,
      "text": "alliteration.\nb. With prompting and support, explore syllables in simple \nwords.\nc. With prompting and support, identify initial sounds in spo -\nken language.\n Standard P3.R.3:   Demonstrate mastery of age-appropriate phonics skills.\na. With prompting and support, begin to identify seven or \nmore consonant names and sounds using one-to-one \nletter-sound correspondence (alphabetic principle).\nb. With prompting and support, begin to identify one or \nmore vowel names and short vowel sounds using one-to-one letter-sound correspondence (alphabetic principle).\n Standard P3.R.4:\n  Begins in kindergarten.\n Standard P3.R.5:  With prompting and support, ask and answer simple ques -\ntions about a text. (RL & RI)\n Standard P3.R.6-7:  With prompting and support, begin to retell simple texts. (RL \n& RI)\n Standard P3.R.8:   Begins in P4.\n Standard P3.R.9:   Begins in kindergarten.\n Standard P3.R.10:   Begins in grade 1.\n Standard P3.R.11:   Begins in grade 4.\n Standard P3.R.12:   Begins in grade 2.\n Standard P3.R.13:   Begins in grade 2.\n Standard P3.R.14:   Begins in grade 2.\nStrand 3:  WRITING (P3.W)\nStudents will learn to write for a variety of tasks, purposes, and audi -\nences using appropriate grammar/conventions, syntax, and style.\n Standard P3.W.1-3:   With prompting and support, begin to experiment with \nspeaking and writing while representing ideas visually (e.g., scribbles, stamps, stickers, or gluing pictures on paper).\n Standard P3.W.4:\n  Participate in shared writing projects. \na. With prompting and support, recall information from"
    },
    {
      "page": 17,
      "text": "others.\nb.With prompting and support, interact and collaborate with\nothers.\nStandard P3.W.5:   With prompting and support, print some age-appropriate\nprewriting strokes."
    },
    {
      "page": 18,
      "text": "Strand 1:  SPEAKING AND LISTENING (P4.SL)\nStudents will learn to collaborate, express and listen to ideas, integrate \nand evaluate information from various sources, use media and visual displays as well as language and grammar strategically to help achieve communicative purposes, and adapt to context and task.\n Standard P4.SL.1:\n  Participate in conversations with peers and adults, using ageappropriate vocabulary on topics and texts.\na. Follow agreed-upon rules for discussions such as listening \nto others, staying on topic, and taking turns speaking. \nb. Follow two-step directions.\nc. Express own ideas.\n Standard P4.SL.2:   Speak clearly and audibly in sentences of varying lengths \nto communicate wants, needs, experiences, thoughts, and \nemotions.\n Standard P4.SL.3:   Use age-appropriate language, grammar, volume, and pro -\nnunciation when speaking or presenting.\nStrand 2:  READING (P4.R) \nStudents will learn to proficiently read and comprehend grade-level literature and informational text, including seminal U.S. documents of historical and literary significance, at the high end of the grade-level text complexity band, with scaffolding as needed. *Standard R.4 includes an \nasterisk to refer educators back to the Text Complexity Grade Bands and As -\nsociated Lexile Ranges in the introduction of the standards.\n Standard P4.R.1:\n  Demonstrate mastery of age-appropriate concepts of print.\na. Correctly hold a book and demonstrate that print is read \nfrom top to bottom, left to right, and from front to back.\nb. Begin to identify frequently seen letters and words, recog -\nnizing that words are made up of letters.\n Standard P4.R.2:   Demonstrate mastery of age-appropriate phonological \nawareness skills.\na. Recognize rhyming words and alliteration.\nb. With prompting and support, segment words into \nsyllables."
    },
    {
      "page": 19,
      "text": "d. Identify the base parts that make up a compound word.e. With prompting and support, blend and segment initial \nsounds of single-syllable spoken words.\nf. With prompting and support, blend and segment singlesyllable words into individual phonemes.\n  Standard P4.R.3:\n Demonstrate mastery of age-appropriate phonics skills. \na. Identify 13 or more of the consonant names and sounds \nusing one-to-one letter-sound correspondence (alphabetic \nprinciple).\nb. Identify three or more vowel names and short vowel \nsounds using one-to-one letter-sound correspondence (alphabetic principle).\n Standard P4.R.4:\n  Begins in kindergarten.\n Standard P4.R.5:   With prompting and support, ask and answer questions and \nmake connections about a text. (RL & RI)\n Standard P4.R.6-7:  With prompting and support, retell simple texts, including \nevent sequence and characters. (RL & RI)\n Standard P4.R.8:   With prompting and support, begin to ask and answer ques -\ntions about unknown words in a text. (RL & RI)\n Standard P4.R.9:   Begins in kindergarten. \n Standard P4.R.10:  Begins in grade 1.\n Standard P4.R.11:  Begins in grade 4.\n Standard P4.R.12:  Begins in grade 2.\n Standard P4.R.13:  Begins in grade 2.\n Standard P4.R.14:  Begins in grade 2. \nStrand 3:  WRITING (P4.W)\nStudents will learn to write for a variety of tasks, purposes, and audi -\nences using appropriate grammar/conventions, syntax, and style.\n Standard P4.W.1:  Verbally share an opinion and visually represent that opinion \nusing simple drawing and writing (e.g., scribble writing with letter-like formations).\n Standard P4.W.2:\n Verbally share information and visually represent that"
    },
    {
      "page": 20,
      "text": "writing with letter-like formations).\n Standard P4.W.3:  Verbally share a narrative and visually represent that narra -\ntive using simple drawing and writing (e.g., scribble writing with letter-like formations).\n Standard P4.W.4:\n Participate in shared writing projects. \na. Recall information from experiences or learned informa -\ntion and share it with others. \nb. Interact and collaborate with others.\n Standard P4.W.5:   Print some mock letters, scribbles, or manuscript letters, \nincluding those in own name."
    },
    {
      "page": 21,
      "text": "Strand 1:  SPEAKING AND LISTENING (K.SL)\nStudents will learn to collaborate, express and listen to ideas, integrate \nand evaluate information from various sources, use media and visual displays as well as language and grammar strategically to help achieve communicative purposes, and adapt to context and task.\n Standard K.SL.1:\n Participate in a range of conversations with peers and adults, \nusing age-appropriate vocabulary on topics and texts.\na. Follow agreed-upon rules for discussions such as listening \nto others, raising hands, and taking turns speaking during discussion.\nb. Continue a conversation through multiple exchanges and \ngain attention appropriately.\nc. Express own ideas in small and large groups.\n Standard K.SL.2:\n  Speak clearly and audibly while expressing thoughts, emo -\ntions, and ideas.\n Standard K.SL.3:  Use age-appropriate language, grammar, volume, and pro -\nnunciation when speaking or presenting and use visual dis -\nplays, when appropriate, to describe information to others.\nStrand 2:  READING (K.R)\nStudents will learn to proficiently read and comprehend grade-level literature and informational text, including seminal U.S. documents of historical and literary significance, at the high end of the grade-level text complexity band, with scaffolding as needed. *Standard R.4 includes an \nasterisk to refer educators back to the Text Complexity Grade Bands and As -\nsociated Lexile Ranges in the introduction of the standards.\n Standard K.R.1:\n Mastered in preschool.\n Standard K.R.2:  Demonstrate mastery of age-appropriate phonological \nawareness skills.\na. Blend and segment words at the syllable level.\nb. Identify the initial, medial, and final sound in 2–3 phoneme \nwords.\nc. Substitute and delete one base part in a compound word."
    },
    {
      "page": 22,
      "text": "neme words—except for CVC words ending with /l/, /r/, or \n/k/ /s/ for the letter x.\n Standard K.R.3:  Demonstrate mastery of age-appropriate phonics skills. \na. Demonstrate mastery of all consonant names and sounds \nusing one-to-one letter-sound correspondence (alphabetic principle).\nb. Demonstrate mastery of short vowel sounds (/ă/, /ĕ/, /ĭ/, \n/ŏ/, /ŭ/) in isolation and in VC and CVC words in single-syllable words.\nc. Demonstrate mastery of long vowel sounds (/ā/, /ē/, /ī/, \n/ō/, /ū/) associated with single letters; open syllables in single-syllable words (e.g., be, I, no).\nd. Demonstrate mastery of segmenting and blending sounds \nin VC and CVC words when reading.\ne. Read and spell common irregular words.\n Standard K.R.4:\n Read grade-level text* with accuracy and fluency to support \ncomprehension. (RL & RI)\n Standard K.R.5:  With prompting and support, ask and answer questions \nabout key details in a text. (RL & RI)\n Standard K.R.6:  Retell familiar stories. (RL) \n Share key details from a text. (RI)\n Standard K.R.7:  Identify the characters, settings, and important events in a \nstory (RL) or pieces of information in a text. (RI)\n Standard K.R.8:   Ask and answer questions about unknown words in a text. \n(RL & RI)\n Standard K.R.9:   Determine or clarify the meaning of multiple-meaning words \nand phrases in context. (RL & RI)\n Standard K.R.10:   Begins in grade 1.\n Standard K.R.11:   Begins in grade 4.\n Standard K.R.12:   Begins in grade 2.\n Standard K.R.13:   Begins in grade 2.\n Standard K.R.14:   Begins in grade 2."
    },
    {
      "page": 23,
      "text": "Students will learn to write for a variety of tasks, purposes, and audi -\nences using appropriate grammar/conventions, syntax, and style.\n Standard K.W.1:   Use a combination of drawing and writing to compose opin -\nion pieces that provide a topic and an opinion. \na. Write, produce, and expand a complete sentence.\nb. Use appropriate capitalization and end punctuation.\n Standard K.W.2:   Use a combination of drawing and writing to compose infor -\nmative/explanatory pieces and provide information about \nthe topic.\na. Write, produce, and expand a complete sentence.\nb. Use appropriate capitalization and end punctuation.\n Standard K.W.3:   Use a combination of drawing and writing to compose narra -\ntive pieces about an event. Provide details about the event in \nthe appropriate sequence and a reaction to what happened.\na. Write, produce, and expand a complete sentence.\nb. Use appropriate capitalization and end punctuation.\n Standard K.W.4:   Participate in shared writing projects. \na. Recall information from experiences or learned \ninformation. \nb. Interact and collaborate with others throughout the writ -\ning process.\n Standard K.W.5:   Legibly write all upper- and lowercase manuscript letters."
    },
    {
      "page": 24,
      "text": "Strand 1:  SPEAKING AND LISTENING (1.SL)\nStudents will learn to collaborate, express and listen to ideas, integrate \nand evaluate information from various sources, use media and visual displays as well as language and grammar strategically to help achieve communicative purposes, and adapt to context and task.\n Standard 1.SL.1:\n  Participate effectively in a range of conversations with vari -\nous partners, using age-appropriate vocabulary on topics and texts. \na. Continue a conversation through multiple exchanges \nwhile using appropriate tone and body language.\nb. Express own ideas clearly in small and large groups and \nbuild on others’ ideas.\n Standard 1.SL.2:\n Speak clearly and audibly while expressing thoughts, emo -\ntions, and ideas while asking and answering questions.\n Standard 1.SL.3:  Use age-appropriate language, grammar, volume, and clear \npronunciation when speaking or presenting and use visual displays, when appropriate, to describe or clarify information to others.\nStrand 2:  : READING (1.R)\nStudents will learn to proficiently read and comprehend grade-level literature and informational text, including seminal U.S. documents of historical and literary significance, at the high end of the grade-level text complexity band, with scaffolding as needed. * Standard R.4 includes an \nasterisk to refer educators back to the Text Complexity Grade Bands and As -\nsociated Lexile Ranges in the introduction of the standards .\n Standard 1.R.1:\n  Mastered in preschool.\n Standard 1.R.2:  Demonstrate mastery of age-appropriate phonological \nawareness skills.\na. Add, delete, and substitute initial and final phonemes in \nsingle-syllable words including blends. \nb. Isolate, pronounce, blend, and segment sounds in 4–5 \nphoneme words, including blends."
    },
    {
      "page": 25,
      "text": "syllable words.\n Standard 1.R.3:  Demonstrate mastery of age-appropriate phonics skills.\na. With prompting and support, identify and begin using con -\nsonant and vowel y while reading (i.e., consonant sound: \n/y/ as in yes, vowel sound: final sound /ī/ as in fly, final sound /ē/ as in baby, and medial sound /ĭ/ in gym).\nb. With prompting and support, identify and begin reading \nand spelling words with all six syllable types (i.e., open, closed, CVCe, vowel team, vowel-r, consonant -le).\nc. Demonstrate mastery of the hard and soft sounds of c and \ng.\nd. Blend words with 4-5 phonemes when reading. \ne. Decode two-syllable words by breaking the words into syl -\nlables (i.e., open, closed, VCe).\nf. Read and spell words with common consonant digraphs \n(i.e., sh, ch, wh, th, ng). \ng. Read age-appropriate compound words.h. Read words with inflectional endings (i.e., -s, -ed, -ing, -er, \n-est).  \ni. Read and spell common irregular words.\n Standard 1.R.4:\n  Read grade-level text* with accuracy and fluency to support \ncomprehension. (RL & RI)\n Standard 1.R.5:   Ask and answer questions about key details in a text. (RL & \nRI)\n Standard 1.R.6:   Read a variety of texts including those from diverse cultures \nto identify and retell the main idea and key details of a text. \n(RL & RI)\n Standard 1.R.7:   Describe characters, settings, and important events in a story \n(RL) or pieces of information in a text. (RI)\n Standard 1.R.8:   Identify specific words and phrases that express emotion, ap -\npeal to the senses, and/or determine the meaning of con -\ntent-specific words within a text. (RL & RI)\n Standard 1.R.9:   Determine or clarify the meaning of unknown and multiplemeaning words and phrases, choosing flexibly from a range of strategies. (RL & RI)\na. Begin using sentence-level context as a clue to the mean -\ning of a word."
    },
    {
      "page": 26,
      "text": "tional forms.\n Standard 1.R.10:   Identify a variety of texts and explain the differences be -\ntween literary texts and informational texts. (RL & RI)\n Standard 1.R.11:   Begins in grade 4.\n Standard 1.R.12:   Begins in grade 2.\n Standard 1.R.13:   Begins in grade 2.\n Standard 1.R.14:   Begins in grade 2.\nStrand 3:  WRITING (1.W)\nStudents will learn to write for a variety of tasks, purposes, and audi -\nences using appropriate grammar/conventions, syntax, and style.\n Standard 1.W.1:   Write opinion pieces that introduce the topic, state an opin -\nion, supply evidence for the opinion, and provide a conclud -\ning statement.\na. Write, produce, and expand complete simple sentences.\nb. Use appropriate conventions when writing.\n Standard 1.W.2:   Write informative/explanatory pieces that introduce a top -\nic, supply facts about the topic, and provide a concluding \nstatement.\na. Write, produce, and expand complete simple sentences.\nb. Use appropriate conventions when writing.\n Standard 1.W.3:   Write narrative pieces that retell two or more events. Provide \ndetails regarding the events using temporal words in se -\nquential order and provide a concluding statement.\na. Write, produce, and expand complete simple sentences.b. Use appropriate conventions when writing.\n Standard 1.W.4:\n  Participate in shared research and writing projects.\na. Recall information from experiences or learned \ninformation.\nb. Interact and collaborate with others throughout the writ -\ning process.\n Standard 1.W.5:  Legibly write all upper- and lowercase manuscript letters."
    },
    {
      "page": 27,
      "text": "Strand 1:  SPEAKING AND LISTENING (2.SL)\nStudents will learn to collaborate, express and listen to ideas, integrate \nand evaluate information from various sources, use media and visual displays as well as language and grammar strategically to help achieve communicative purposes, and adapt to context and task.\n Standard 2.SL.1:\n  Participate effectively in a range of conversations with vari -\nous partners, using age-appropriate vocabulary on topics and texts.\na. Initiate and build on a conversation through multiple ex -\nchanges while using appropriate tone and body language.\nb. Seek other's opinions or thoughts and identify other's perspectives.\n Standard 2.SL.2:\n  Speak clearly and audibly while asking and answering ques -\ntions about a topic and key details.\n Standard 2.SL.3:   Use age-appropriate language, grammar, volume, and clear \npronunciation when speaking or presenting.\na. Present information, stories, or opinions, sequencing ideas logically and use descriptions, facts, and details.\nStrand2 :  READING (2.R)\nStudents will learn to proficiently read and comprehend grade-level literature and informational text, including seminal U.S. documents of historical and literary significance, at the high end of the grade-level text complexity band, with scaffolding as needed. *Standard R.4 includes an \nasterisk to refer educators back to the Text Complexity Grade Bands and As -\nsociated Lexile Ranges in the introduction of the standards.\n Standard 2.R.1:\n  Mastered in preschool.\n Standard 2.R.2:   Demonstrate mastery of age-appropriate phonological aware -\nness skills.\na. Add, delete, and substitute initial, medial, and final sounds in 5–6 phoneme words including blends.\nb. Isolate, pronounce, blend, and segment phonemes in 5–6 phoneme words."
    },
    {
      "page": 28,
      "text": "a. Identify and begin reading and spelling words with all six \nsyllable types (i.e., open, closed, CVCe, vowel team, vowel-r, consonant -le) in multisyllabic words.\nb. Identify and begin using schwa in multisyllabic words (e.g., ago, away, again, along, afraid) when reading and spelling .\nc. Blend words with 5-6 phonemes when reading. \nd. Decode words with common prefixes and suffixes.\ne. Read and spell age-appropriate compound words.\nf. Read and spell words with common variant digraphs (i.e., ph /f/, gh /f/, ch /sh/ and /ck/).\ng. Read and spell words with common trigraphs (i.e., tch /ch/ and dge /j/). \nh. Read and spell words with hard and soft c and g along with silent letters kn-, -lm, -mb, gh-, and wr-.\ni.  Read and spell words with the following diphthongs and vowels (i.e., oi, oy; ou, ow; au, aw; oo, u).\nj. Read and spell words with phonograms (i.e., -old, -ild, -ost, -olt, -ind).\nk. Read and spell common irregular words.\n Standard 2.R.4:  Read grade-level text* with accuracy and fluency to support \ncomprehension. (RL & RI)\n Standard 2.R.5:  Ask and answer questions such as who, what, where, when, \nwhy, and how to demonstrate understanding of key details in a text. (RL & RI)\n Standard 2.R.6:\n Read a variety of texts including those from diverse cultures, \nretell the narrative (RL) or informational text (RI) according to the text structure including the main idea.\n Standard 2.R.7:\n Describe how characters respond to major events and chal -\nlenges. (RL). \nDescribe the connection between a series of historical events, \nscientific ideas or concepts, or steps in technical procedures in a text. (RI)\n Standard 2.R.8:\n Explain how specific words and phrases express emotion, \nappeal to the senses, or determine the meaning of content-specific words within a text. (RL & RI) \n Standard 2.R.9:\n Determine or clarify the meaning of unknown and multiplemeaning words and phrases, choosing flexibly from a range of strategies. (RL & RI)"
    },
    {
      "page": 29,
      "text": "word.\nb. Determine the meaning of a new word when a known pre -\nfix or root is used.\nc. Predict the meaning of compound words using knowledge of the meaning of the individual words.\nd. Use glossaries and dictionaries to determine the meaning of words and phrases.\n Standard 2.R.10:\n Describe the overall literary and informational text structure \nto locate facts, details, and information efficiently. (RL & RI)\n Standard 2.R.11:   Begins in grade 4.\n Standard 2.R.12:   Demonstrate understanding of story elements and/or topics \nby applying information gained from illustrations or text fea -\ntures. (RL & RI)\n Standard 2.R13:   Not applicable for RL. \nExplain how specific points an author or illustrator makes in a text are supported by relevant reasons and evidence. (RI)\n Standard 2.R.14:\n Compare two or more versions of the same text from differ -\nent cultures and the most important points presented by two texts on the same topic. (RL & RI)\nStrand 3:  WRITING (2.W)\nStudents will learn to write for a variety of tasks, purposes, and audi -\nences using appropriate grammar/conventions, syntax, and style.\n Standard 2.W.1:\n  Write opinion pieces that introduce the topic, state an opin -\nion, supply evidence that supports the opinion, use linking words to connect opinion and evidence, and provide a con -\ncluding statement.\na. Write, produce, expand, and rearrange complete simple and compound sentences.\nb. Use appropriate conventions when writing.\n Standard 2.W.2:   Write informative/explanatory pieces that introduce a topic, \nsupply facts and definitions to develop points, and provide a concluding statement.\na. Write, produce, expand, and rearrange complete simple and compound sentences."
    },
    {
      "page": 30,
      "text": " Standard 2.W.3:   Write narrative pieces in which they retell an elaborated event \nor short sequence of events; include details to describe ac -\ntions, thoughts, and emotions using temporal words in se -\nquential order; and provide a concluding statement.\na. Write, produce, expand, and rearrange complete simple \nand compound sentences. \nb. Use appropriate conventions when writing.\n Standard 2.W.4:   Participate in shared research and writing projects on a topic.\na. Recall and gather information from provided sources to answer a question about the topic.\nb. Interact and collaborate with others throughout the writing process.\n Standard 2.W.5:\n  Fluently write all upper- and lowercase manuscript letters."
    },
    {
      "page": 31,
      "text": "Strand 1:  SPEAKING AND LISTENING (3.SL)\nStudents will learn to collaborate, express and listen to ideas, integrate \nand evaluate information from various sources, use media and visual displays as well as language and grammar strategically to help achieve communicative purposes, and adapt to context and task.\n Standard 3.SL.1:\n  Participate effectively in a range of conversations and collabo -\nrations, using age-appropriate vocabulary, on topics, texts, and issues.\na. Respectfully acknowledge and respond to others' perspec -\ntives during discussions.\nb. Recognize that comments and claims may include two perspectives. \nc. Participate in conversations by asking questions, acknowl -\nedging new information, connecting responses, and keep -\ning the discussion on topic.\n Standard 3.SL.2:  Speak clearly and audibly while asking and answering ques -\ntions about a topic and key details presented in various medi -\nums and formats.\n Standard 3.SL.3:  Use age-appropriate language, grammar, volume, and clear \npronunciation when speaking or presenting.\na. Present information, stories, or opinions, sequencing ideas logically and use relevant descriptions, facts, and details to elaborate on main ideas and themes.\nStrand 2:  READING (3.R)\nStudents will learn to proficiently read and comprehend grade-level literature and informational text, including seminal U.S. documents of historical and literary significance, at the high end of the grade-level text complexity band, with scaffolding as needed. *Standard R.4 includes an \nasterisk to refer educators back to the Text Complexity Grade Bands and As -\nsociated Lexile Ranges in the introduction of the standards.\n Standard 3.R.1:\n  Mastered in preschool.\n Standard 3.R.2:   Demonstrate mastery of age-appropriate phonological aware -\nness skills."
    },
    {
      "page": 32,
      "text": "b. Phoneme chaining including addition, deletion, and substi -\ntution at all word positions (initial, final, and medial).\n Standard 3.R.3:   Demonstrate mastery of age-appropriate phonics skills.\na. Identify and begin using the combined knowledge of all \nletter-sound correspondences, syllabication patterns, mor -\nphology (e.g., roots and affixes), and etymology to accurate -\nly read unfamiliar multisyllabic words in and out of context.\nb. Read and spell words with all six syllable types (i.e., open, closed, CVCe, vowel team, vowel-r, consonant -le) in multi -\nsyllabic words.\nc. Identify and know the meaning of the most common pre -\nfixes and derivational suffixes.\nd. Identify the unaccented syllable in multisyllabic words (e.g., nation, active, atomic) when reading and spelling.\ne. Read and spell common irregular words.\n Standard 3.R.4:   Read grade-level text* with accuracy and fluency to support \ncomprehension. (RL & RI)\n Standard 3.R.5:   Ask and answer questions to demonstrate understanding of \na text, referring explicitly to the text as the basis for the an -\nswers. (RL & RI)\n Standard 3.R.6:   Read a variety of texts including those from diverse cultures, \nretell the text according to the text structure including the main idea and how key details support the main idea. (RL & RI)\n Standard 3.R.7:\n  Describe characters in a story and explain how their actions \ncontribute to the sequence of events. (RL) \nDescribe the relationship between a series of historical \nevents, scientific ideas or concepts, or steps in technical pro -\ncedures in a text, using language that pertains to time, se -\nquence, and cause/effect. (RI)\n Standard 3.R.8:   Determine the meaning of words, phrases, similes, meta -\nphors, and academic and content-specific words within a text. (RL & RI)\n Standard 3.R.9:\n  Determine or clarify the meaning of unknown and multiplemeaning words and phrases choosing flexibly from a range of strategies. (RL & RI)\na. Use sentence-level context as a clue to the meaning of a word or phrase."
    },
    {
      "page": 33,
      "text": "or root is used.\nc. Use glossaries or dictionaries to determine or clarify the precise meaning of key words and phrases.\n Standard 3.R.10:\n  Identify and discuss the structural elements of different types \nof text when writing or speaking about a text. (RL) \nUse text features and search tools to build comprehension \nand locate relevant information efficiently. (RI)\n Standard 3.R.11:   Begins in grade 4.\n Standard 3.R.12:   Explain how specific illustrations or text features contribute to \nwhat is conveyed by the words in a text. (RL & RI)\n Standard 3.R.13:   Not applicable for RL. \nExplain how claims in a text are supported by relevant rea -\nsons and evidence. (RI)\n Standard 3.R.14:   Compare the themes, settings, and plots of stories written \nabout the same or similar characters. (RL) \nCompare the most important points and key details present -\ned in two texts on the same topic. (RI)\nStrand 3:  WRITING (3.W)\nStudents will learn to write for a variety of tasks, purposes, and audi -\nences using appropriate grammar/conventions, syntax, and style.\n Standard 3.W.1:   Write argumentative pieces on topics and/or texts, supporting \na point of view with evidence, using linking words and phrases \nto connect the claim to the evidence, and provide a conclud -\ning statement. \na. Introduce the topic, state a claim, and create an organiza -\ntional structure that provides evidence.\nb. Write, produce, and expand simple, compound, and com -\nplex sentences.\nc. Use appropriate conventions when writing including text cohesion, sentence structure, and phrasing.\n Standard 3.W.2:\n  Write informative/explanatory pieces to examine a topic that \nconveys ideas and information clearly, link ideas within cat -\negories of information using words and phrases, and provide a concluding statement.\na. Introduce and develop a topic using facts, definitions,"
    },
    {
      "page": 34,
      "text": "together.\nb. Write, produce, and expand simple, compound, and com -\nplex sentences.\nc. Use appropriate conventions when writing including text cohesion, sentence structure, and phrasing.\n Standard 3.W.3:\n  Write narrative pieces to develop real or imagined experi -\nences or events using effective technique, descriptive details, event sequences, and provide a concluding statement.\na. Set the scene and introduce a narrator and/or characters; organize an event sequence that unfolds naturally.\nb. Write, produce, and expand simple, compound, and com -\nplex sentences.\nc. Use dialogue and descriptions of actions, thoughts, and emotions.\nd. Use appropriate conventions when writing including text cohesion, sentence structure, and phrasing.\n Standard 3.W.4:\n  Conduct short research projects to build knowledge about a \ntopic.\na. Recall and gather relevant information from one or more sources and provide brief notes to demonstrate under -\nstanding of the topic.\nb. Interact and collaborate with others throughout the writing process.\n Standard 3.W.5:\n  Legibly write all upper- and lowercase cursive and manuscript \nletters."
    },
    {
      "page": 35,
      "text": "Strand:  SPEAKING AND LISTENING (4.SL)\nStudents will learn to collaborate, express and listen to ideas, integrate \nand evaluate information from various sources, use media and visual displays as well as language and grammar strategically to help achieve communicative purposes, and adapt to context and task.\n Standard 4.SL.1:\n  Participate effectively in a range of conversations and collabo -\nrations, using age-appropriate vocabulary, on topics, texts, and issues.\na. Respectfully acknowledge and respond to comments and claims.\nb. Participate in conversations by asking questions, acknowl -\nedging new information, connecting responses with rea -\nsoning and elaboration, and keeping the discussion on topic.\n Standard 4.SL.2:\n  Clearly summarize information presented in various formats \nand mediums and explain how the information pertains to the topic.\n Standard 4.SL.3:\n Use age-appropriate language, grammar, volume, and clear \npronunciation when speaking or presenting.\na. Include visual displays and/or mediums, when appropriate, to convey information, elaborate, and enhance engage -\nment of presentations.\nStrand:  READING (4.R)\nStudents will learn to proficiently read and comprehend grade-level literature and informational text, including seminal U.S. documents of historical and literary significance, at the high end of the grade-level text complexity band, with scaffolding as needed. *Standard R.4 includes an \nasterisk to refer educators back to the Text Complexity Grade Bands and As -\nsociated Lexile Ranges in the introduction of the standards.\n  Standard 4.R.1:\n  Mastered in preschool.\n Standard 4.R.2:   Mastered in grade 3."
    },
    {
      "page": 36,
      "text": "a. Use combined knowledge of all letter-sound correspon -\ndences, syllabication patterns, morphology (e.g., roots and \naffixes), and etymology to accurately read unfamiliar multi -\nsyllabic words in context and out of context.\n Standard 4.R.4:   Read grade-level text* with accuracy and fluency to support \ncomprehension. (RL & RI)\n Standard 4.R.5:   Refer to details and evidence in a text when explaining what \nthe text says explicitly and when drawing inferences from the text. (RL & RI)\n Standard 4.R.6:\n  Read a variety of text types, including those from diverse \ncultures to determine a theme or main idea and explain how it is supported by key details; summarize texts using textual evidence. (RL & RI)\n Standard 4.R.7:\n  Describe in depth a character, setting, or event in a story or \ndrama, drawing on specific details in the text. (RL)\nExplain events, procedures, ideas, or concepts in a historical, \nscientific, or technical text, including what happened and why, based on specific information in the text. (RI)\n Standard 4.R.8:\n  Determine the meaning of words, phrases, figurative lan -\nguage, academic and content-specific words within a text. (RL & RI)\n Standard 4.R.9:\n  Determine or clarify the meaning of unknown and multiplemeaning words and phrases, choosing flexibly from a range of strategies. (RL & RI)\na. Use context as a clue to the meaning of a word. \nb. Use common Greek and Latin affixes and roots as clues to the meaning of a word.\nc. Consult reference materials to find the pronunciation and determine or clarify the precise meaning of key words and phrases.\n Standard 4.R.10:\n  Analyze and discuss the parts of literary text using terms such \nas chapter, scene, and stanza. (RL)\nDescribe the overall structure using terms such as sequence, \ncomparison, cause/effect, and problem/solution. (RI)\n Standard 4.R.11:   Compare the point of view from which different stories \nare narrated, including the difference between first- and"
    },
    {
      "page": 37,
      "text": "Compare a primary and secondary source on the same event \nor topic. (RI)\n Standard 4.R.12:   Compare a visual or oral presentation of a story or drama \nwith the text itself and identify where each version reflects specific descriptions and directions in the text. (RL) \nInterpret information presented visually, orally, or quantita -\ntively and explain how the information contributes to an un -\nderstanding of the text in which it appears. (RI)\n Standard 4.R.13:\n  Not applicable to RL. \nExplain how an author uses reasons and evidence to support \nparticular claims in a text. (RI)\n Standard 4.R.14:   Compare the treatment of similar themes and topics and \npatterns of events in stories, myths, and traditional literature from different cultures. (RL) \nIntegrate information from two texts on the same topic in or -\nder to write or speak about the subject knowledgeably. (RI)\nStrand:  WRITING (4.W)\nStudents will learn to write for a variety of tasks, purposes, and audi -\nences using appropriate grammar/conventions, syntax, and style.\n Standard 4.W.1:\n  Write argumentative pieces on topics and/or texts, supporting \na point of view with evidence and information, using linking \nwords and phrases to connect the claim to the evidence, and provide a concluding section related to the claim presented.\na. Introduce a topic, state a claim that is supported by evi -\ndence, produce complex sentences, and create an orga -\nnizational structure in which related ideas are grouped to support the writer’s purpose.\nb. Use appropriate conventions when writing including text cohesion, sentence structure, and phrasing.\n Standard 4.W.2:\n  Write informative/explanatory pieces to examine a topic that \nconveys ideas and information clearly, link ideas within cat -\negories of information using words and phrases, and provide a concluding section related to the information or explanation presented.\na. Introduce a topic and group related information in para -\ngraphs and/or sections using organizational structures,"
    },
    {
      "page": 38,
      "text": "the writer's purpose. \nb. Develop the topic using relevant facts, definitions, concrete details, quotations, or examples.\nc. Use precise language and content-specific vocabulary to inform about or explain the topic.\nd. Use appropriate conventions when writing including text cohesion, sentence structure, and phrasing.\n Standard 4.W.3:\n  Write narrative pieces to develop real or imagined experi -\nences or events using effective technique, descriptive details, clear event sequences, and provide a resolution.\na. Orient the reader by establishing a situation and introduc -\ning a narrator and/or characters; organize an event se -\nquence that unfolds naturally.\nb. Use dialogue and description to develop experiences and events or show the responses of characters to situations.\nc. Use a variety of transitional words and phrases to manage the sequence of events.\nd. Use concrete words, phrases, complex sentences, and sen -\nsory details to convey experiences and events precisely.\ne. Use appropriate conventions when writing including text cohesion, sentence structure, and phrasing.\n Standard 4.W.4:\n  Conduct short research projects to build knowledge through \ninvestigation of different aspects of a topic.\na. Recall, gather, and organize information and provide a list of relevant sources.\nb. Elaborate to demonstrate understanding of the topic under investigation. \nc. Interact and collaborate with others throughout the writing process.\n Standard 4.W.5:\n  Fluently write in cursive and manuscript."
    },
    {
      "page": 39,
      "text": "Strand 1:  SPEAKING AND LISTENING (5.SL)\nStudents will learn to collaborate, express and listen to ideas, integrate \nand evaluate information from various sources, use media and visual displays as well as language and grammar strategically to help achieve communicative purposes, and adapt to context and task.\n Standard 5.SL.1:\n  Participate effectively in a range of conversations and collabo -\nrations using age-appropriate vocabulary, on topics, texts, and issues.\na. Respectfully acknowledge and respond to comments and claims from multiple perspectives and determine if addi -\ntional information is needed. \nb. Participate in conversations by asking questions, acknowl -\nedging new information, qualifying or justifying responses with reasoning and elaboration, and keeping the discussion on topic.\n Standard 5.SL.2:\n Investigate information presented in various formats and me -\ndiums in order to make informed decisions and differentiate between fact and fiction.\n Standard 5.SL.3:\n  Use age-appropriate language, grammar, volume, and clear \npronunciation when speaking or presenting.\na. Present claims and findings, sequencing ideas logically and use relevant descriptions, facts, and details to elaborate on main ideas or themes.\nStrand 2:  READING (5.R)\nStudents will learn to proficiently read and comprehend grade-level literature and informational text, including seminal U.S. documents of historical and literary significance, at the high end of the grade-level text complexity band, with scaffolding as needed. *Standard R.4 includes an \nasterisk to refer educators back to the Text Complexity Grade Bands and As -\nsociated Lexile Ranges in the introduction of the standards.\n Standard 5.R.1:\n  Mastered in preschool.\n Standard 5.R.2:   Mastered in grade 3."
    },
    {
      "page": 40,
      "text": "a. Read and spell all letter-sound correspondences, syllabi -\ncation patterns, morphology (e.g., roots and affixes), and \netymology to accurately read unfamiliar multisyllabic words in context and out of context.\n Standard 5.R.4:\n  Read grade-level text* with accuracy and fluency to support \ncomprehension. (RL & RI)\n Standard 5.R.5:   Identify and refer to evidence from a text when explaining \nwhat the text says explicitly and when drawing inferences from the text. (RL & RI)\n Standard 5.R.6:\n  Determine the theme or main idea of a text including those \nfrom diverse cultures and how it is conveyed through particu -\nlar details and summarize the text. (RL & RI)\n Standard 5.R.7:   Compare two characters, settings, or events in a story or \ndrama, drawing on specific details in the text. (RL) \nExplain the relationships or interactions between two or more \nindividuals, events, ideas, or concepts in a historical, scientific, or technical text based on specific information in the text. (RI)\n Standard 5.R.8:\n  Determine the meaning of words, phrases, figurative lan -\nguage, academic and content-specific words, and analyze their effect on meaning within a text. (RL & RI)\n Standard 5.R.9:\n  Determine or clarify the meaning of unknown and multiplemeaning words and phrases, choosing flexibly from a range of strategies. (RL & RI)\na. Use context as a clue to the meaning of a word or phrase.\nb. Use Greek and Latin affixes and roots as clues to the mean -\ning of a word.\nc. Consult reference materials to find the pronunciation and determine the precise meaning of key words and phrases.\n Standard 5.R.10:\n  Analyze how a series of chapters, scenes, or stanzas fits to -\ngether to provide the overall structure of a literary text. (RL) \nCompare the overall structure in two or more texts using \nterms such as sequence, comparison, cause/effect, and prob -\nlem/solution. (RI)\n Standard 5.R.11:   Explain how a narrator’s or speaker’s point of view influences \nhow events are described. (RL) \nAnalyze multiple accounts of the same event or topic, noting"
    },
    {
      "page": 41,
      "text": "represent. (RI)\n Standard 5.R.12:   Analyze how the visual and multimedia elements contribute \nto the meaning, tone, or beauty of a text. (RL) \nDraw on information from multiple sources including media \nto locate an answer to a question or to solve a problem. (RI)\n Standard 5.R.13:  Not applicable to RL. \nExplain how an author uses reasons and evidence to support particular claims in a text, identifying which reasons and evi -\ndence support which claims. (RI)\n Standard 5.R.14:\n  Compare stories in the same genre on their approaches to \nsimilar themes and topics. (RL) \nIntegrate information from several texts on the same topic in \norder to write or speak about the subject knowledgeably. (RI)\nStrand:  WRITING (5.W)\nStudents will learn to write for a variety of tasks, purposes, and audi -\nences using appropriate grammar/conventions, syntax, and style.\n Standard 5.W.1:   Write argumentative pieces on topics and/or texts, supporting \na point of view with evidence and information, using linking words, phrases, and clauses to connect the claim to the evi -\ndence, and provide a concluding section related to the claim presented.\na. Introduce a topic, state a claim supported by evidence, and create an organizational structure in which ideas are logi -\ncally grouped to support the writer’s purpose.\nb. Expand, combine, and reduce sentences for meaning, reader/listener interest, and style to develop the argument. \nc. Use appropriate conventions when writing including text cohesion, sentence structure, and phrasing.\n Standard 5.W.2:\n Write informative/explanatory pieces to examine a topic that \nlinks and conveys ideas and information clearly, using words, phrases, and clauses to show the relationship between ideas, paragraphs, and/or sections, and provide a concluding section related to the information or explanation presented.\na. Introduce a topic and group related information in para -\ngraphs and/or sections using organizational structures,"
    },
    {
      "page": 42,
      "text": "multimedia when useful, to support the writer's purpose. \nb. Develop the topic using relevant facts, definitions, concrete details, quotations, or examples. \nc. Use precise language and content-specific vocabulary to inform about or explain the topic.\nd. Use appropriate conventions when writing including text cohesion, sentence structure, and phrasing\n Standard 5.W.3:\n Write narrative pieces to develop real or imagined experi -\nences or events using effective technique, descriptive details, well-structured event sequences, and provide a resolution.\na. Orient the reader by establishing a situation and introduc -\ning a narrator and/or characters; organize an event se -\nquence that unfolds naturally.\nb. Use narrative techniques, such as dialogue, description, and pacing, to develop experiences and events or show the responses of characters to situations.\nc. Use a variety of transitional words, phrases, and clauses to manage the sequence of events.\nd. Use concrete words, phrases, complex sentences, and sen -\nsory details to convey experiences and events precisely.\ne. Use appropriate conventions when writing including text cohesion, sentence structure, and phrasing.\n Standard 5.W.4:\n  Conduct short research projects to craft an argument or an -\nswer a question.\na. Gather, summarize, and paraphrase information and pro -\nvide a list of relevant sources.\nb. Elaborate to demonstrate understanding of the topic under investigation. \nc. Interact and collaborate with others throughout the writing process.\n Standard 5.W.5:\n  Fluently write in cursive and manuscript."
    },
    {
      "page": 43,
      "text": "Strand 1:  SPEAKING AND LISTENING (6.SL)\nStudents will learn to collaborate, express and listen to ideas, integrate \nand evaluate information from various sources, use media and visual displays as well as language and grammar strategically to help achieve communicative purposes, and adapt to context and task.\n Standard 6.SL.1:\n  Participate effectively in a range of conversations and collabo -\nrations on topics, texts, and issues.\na. Respectfully acknowledge comments, claims, and evidence from multiple perspectives and identify contradictions when applicable.\nb. Participate in conversations by posing questions, acknowl -\nedging new information, qualifying or justifying responses with reasoning and elaboration, and keeping the discussion on topic.\n Standard 6.SL.2:\n   Interpret credible information presented in various formats \nand mediums to make informed decisions.\n Standard 6.SL.3:   Use appropriate language, grammar, organization, develop -\nment, and delivery styles appropriate to purpose and audi -\nence for formal or informal contexts.\na. Use visual displays of data, including digital media, to con -\nvey information and engage the audience.\nStrand 2:  READING (6.R)\nStudents will learn to proficiently read and comprehend grade-level literature and informational text, including seminal U.S. documents of historical and literary significance, at the high end of the grade-level text complexity band, with scaffolding as needed. *Standard R.4 includes an \nasterisk to refer educators back to the Text Complexity Grade Bands and As -\nsociated Lexile Ranges in the introduction of the standards.\n  Standard 6.R.1:\n  Mastered in preschool.\n Standard 6.R.2:  Mastered in grade 3.\n Standard 6.R.3:  Mastered in grade 5."
    },
    {
      "page": 44,
      "text": "comprehension. (RL & RI)\n Standard 6.R.5:   Cite textual evidence to support analysis of what the text says \nexplicitly as well as inferences drawn from the text. (RL & RI)\n Standard 6.R.6:   When reading texts, including those from diverse cultures, \ndetermine the theme, how characters respond to conflict or \nhow the speaker reflects upon a topic, and summarize the text. (RL)\nWhen reading texts, including those from diverse cultures, \ndetermine the main idea of a text, explain how they are sup -\nported by key details and summarize the text. (RI)\n Standard 6.R.7:\n  Compare two or more characters, settings, or events in a \nstory or drama, drawing on specific details in the text. (RL) \nAnalyze in detail how a key individual, event, or idea is intro -\nduced, illustrated, and elaborated in a text. (RI)\n Standard 6.R.8:   Determine the meaning of words and phrases, including figu -\nrative language, connotative meanings, and figures of speech. \nAnalyze the impact of specific word choices on meaning and tone, including words with multiple meanings within a text. (RL & RI)\n Standard 6.R.9:\n  Determine or clarify the meaning of unknown and multiplemeaning words and phrases, choosing flexibly from a range of strategies. (RL & RI) \na. Consistently use context as a clue to the meaning of a word or phrase.\nb. Consistently use Greek or Latin affixes and roots as clues to the meaning of a word. \nc. Consult reference materials to find the pronunciation of a word or determine its precise meaning or its part of speech.\n Standard 6.R.10:\n  Analyze how a sentence, paragraph, stanza, chapter, scene, or \nsection fits into the overall structure and how it contributes to the development of theme, main idea, settings, or plot. (RL) \nAnalyze how a particular sentence, paragraph, chapter, or \nsection fits into the overall structure of a text and how it con -\ntributes to the development of the main idea. (RI)\n Standard 6.R.11:\n  Explain how an author's perspective develops the point of \nview of the narrator or speaker in multiple texts. (RL)"
    },
    {
      "page": 45,
      "text": "position from that of others. (RI)\n Standard 6.R.12:  Compare how different mediums, including print and digital \nmedia, contribute to the understanding of a text. (RL & RI)\n Standard 6.R.13:  Not applicable to RL. \nEvaluate the argument and specific claims in a text, distin -\nguishing claims that are supported by reasons and evidence from claims that are not. (RI)\n Standard 6.R.14:\n Compare texts across different mediums or genres in terms \nof their approaches to similar themes and topics. (RL) \nCompare one author’s presentation of events with that of an -\nother. (RI)\nStrand 3:  WRITING (6.W)\nStudents will learn to write for a variety of tasks, purposes, and audi -\nences using appropriate grammar/conventions, syntax, and style.\n Standard 6.W.1:   Write arguments to support claims with clear reasons and \nrelevant evidence, and provide a concluding section related to \nthe argument presented. \na. Introduce claims supported by evidence from cred -\nible sources, and create an organizational structure in which claims are logically grouped to support the writer’s purpose. \nb. Use words, phrases, and clauses to clarify the relationships among claims and evidence. \nc. Use appropriate conventions and style for the audience, purpose, and task.\n Standard 6.W.2:\n Write informative/explanatory texts to examine a topic that \nconveys ideas and information clearly and provide a con -\ncluding section that supports the information or explanation presented.\na. Introduce a topic; organize ideas, concepts, and informa -\ntion, using structures such as definition, classification, comparison/contrast, and cause/effect; include formatting, graphics, and multimedia when useful.\nb. Develop the topic with relevant facts, definitions, concrete details, quotations, and examples.\nc. Use appropriate transitions to clarify the relationships among ideas and concepts."
    },
    {
      "page": 46,
      "text": "inform about or explain the topic.\ne. Use appropriate conventions and style for the audience, purpose, and task.\n Standard 6.W.3:\n  Write narrative texts to develop real or imagined experi -\nences or events using effective technique, relevant descrip -\ntive details, well-structured event sequences, and provide a resolution.\na. Engage and orient the reader by establishing a context and introducing a narrator and/or characters; organize an event sequence that unfolds naturally and logically.\nb. Use narrative techniques, such as dialogue, descrip -\ntion, and pacing, to develop experiences, events, and/or characters.\nc. Use a variety of transition words, phrases, and clauses to convey sequence and signal shifts from one time frame or setting to another.\nd. Use precise words, phrases and complex sentences, rel -\nevant descriptive details, and sensory language to convey experiences and events.\ne. Use appropriate conventions and style for the audience, purpose, and task.\n Standard 6.W.4:\n Conduct short research projects to craft an argument or an -\nswer a question.\na. Gather, synthesize, and use information from credible \nsources on the topic.  \nb. Generate ideas to demonstrate understanding of the topic under investigation. \nc. Avoid plagiarism by quoting or paraphrasing and provide basic bibliographic information for sources.\nd. Interact and collaborate with others throughout the writing process.\n Standard 6.W.5:\n Mastered in grade 5."
    },
    {
      "page": 47,
      "text": "Strand 1:  SPEAKING AND LISTENING (7–8.SL) \nStudents will learn to collaborate, express and listen to ideas, integrate \nand evaluate information from various sources, use media and visual displays as well as language and grammar strategically to help achieve communicative purposes, and adapt to context and task.\n Standard 7–8.SL.1:\n Participate effectively in a range of conversations and col -\nlaborations on topics, texts, and issues.\na. Respond thoughtfully in democratic discussions that in -\nvolve decision-making and role-taking and determine if additional information or research is required to deepen the discussion.\nb. Participate in conversations by asking and responding to questions and provide the opportunity to consider a range of perspectives. \n Standard 7–8.SL.2:\n Evaluate the credibility of multiple sources of information \npresented in various formats and mediums to make in -\nformed decisions.\n Standard 7–8.SL.3:  Use appropriate language, grammar, organization, devel -\nopment, and delivery styles appropriate to purpose and audience for formal or informal contexts.\na. Convey a clear perspective by presenting and citing in -\nformation, findings, and supporting evidence so that lis -\nteners can follow the line of reasoning.\nStrand 2:  READING (7–8.R)\nStudents will learn to proficiently read and comprehend grade-level literature and informational text, including seminal U.S. documents of historical and literary significance, at the high end of the grade-level text complexity band, with scaffolding as needed. *Standard R.4 includes an \nasterisk to refer educators back to the Text Complexity Grade Bands and As -\nsociated Lexile Ranges in the introduction of the standards.\n Standard 7–8.R.1:\n Mastered in preschool.\n Standard 7–8.R.2:  Mastered in grade 3."
    },
    {
      "page": 48,
      "text": " Standard 7–8.R.4:  Read grade-level text* with accuracy and fluency to sup -\nport comprehension. (RL & RI)\n Standard 7–8.R.5:  Cite textual evidence that supports an analysis of what the \ntext says explicitly as well as inferences drawn from the \ntext. (RL & RI)\n Standard 7–8.R.6:  When reading texts, including those from diverse cultures, \ndetermine a theme, analyze its development including its relationship to the characters, settings, and plot, and pro -\nvide an objective summary that includes textual evidence. (RL)\nWhen reading texts, including those from diverse cultures, \ndetermine the main idea, analyze its relationship to sup -\nporting ideas, and provide an objective summary that in -\ncludes textual evidence. (RI)\n Standard 7–8.R.7:\n Analyze the impact of character and plot development on \nthe overall story or drama. (RL) \nAnalyze a complex set of ideas or sequence of events and \nexplain how specific individuals, ideas, or events interact and develop over the course of the text. (RI)\n Standard 7–8.R.8:\n Determine the meaning of words and phrases, including \nfigurative, connotative, and technical meanings. Analyze the impact of specific word choices on meaning, tone, and mood, including words with multiple meanings within a text. (RL & RI)\n Standard 7–8.R.9:\n Determine or clarify the meaning of unknown and multi -\nple-meaning words and phrases, choosing flexibly from a range of strategies. (RL & RI)\na. Determine and consult appropriate reference materials to find the pronunciation of a word or determine its pre -\ncise meaning or its part of speech.\n Standard 7–8.R.10:\n Analyze the structure an author uses to organize a text, \nand how it contributes to the text meaning. (RL & RI)\n Standard 7–8.R.11:  Analyze how an author develops and contrasts the points \nof view of different characters or narrators in a text and how this creates a variety of effects (e.g., humor, sadness, suspense). (RL) \nDetermine an author’s point of view or purpose in a text"
    },
    {
      "page": 49,
      "text": "from that of others and responds to conflicting evidence or viewpoints. (RI)\n Standard 7–8.R.12:\n Compare a text to another text in a different medium \nabout the same topic and evaluate the impact of the differ -\nences on the audience. (RL & RI)\n Standard 7–8.R.13:  Not applicable to RL.\nEvaluate an argument and specific claims in a text, assess -\ning the validity of key statements by examining whether the supporting evidence is relevant and sufficient. (RI)\n Standard 7–8.R.14:\n Compare two or more works of fiction with similar themes \nor topics, drawing on patterns of events or character types. (RL)\nCompare how two or more texts about the same topic \nshape their presentations by emphasizing different evi -\ndence or advancing different interpretations of facts; iden -\ntify where the texts disagree on matters of fact or interpre -\ntation. (RI)\nStrand 3:  WRITING (7-8.W)\nStudents will learn to write for a variety of tasks, purposes, and audi -\nences using appropriate grammar/conventions, syntax, and style.\n Standard 7–8.W.1:\n Write arguments to support claims with logical reasoning, \nrelevant evidence from accurate and credible sources, and provide a conclusion that follows from and supports the argument presented.\na. Introduce claims, distinguish the claims from alternate or opposing claims, and organize the reasons and evi -\ndence logically.\nb. Use words, phrases, and clauses to create cohesion and clarify the relationships among claims, counterclaims, reasons, and evidence.\nc. Use appropriate conventions and style for the audience, purpose, and task.\n Standard 7–8.W.2:\n Write informative/explanatory texts to examine a topic \nand convey ideas and information through the selection, organization, and analysis of relevant content, and provide a conclusion that supports the information or explanation presented."
    },
    {
      "page": 50,
      "text": "nize ideas and information into broader categories; uti -\nlize formatting, graphics, and multimedia related to the \ntopic.\nb. Develop the topic with relevant facts, definitions, con -\ncrete details, quotations, and examples. \nc. Use appropriate and varied transitions to create cohe -\nsion and clarify the relationships among ideas. \nd. Use precise language and content-specific vocabulary to inform about or explain the topic. \ne. Use appropriate conventions and style for the audience, purpose, and task.\n Standard 7–8.W.3:\n Write narrative texts to develop real or imagined experi -\nences or events using effective technique, well-structured event sequences, descriptive details, and provide a logical resolution.\na. Engage and orient the reader by describing a problem, situation, or observation.\nb. Introduce a setting, narrator and/or characters.\nc. Apply narrative techniques, such as dialogue and de -\nscription, to develop characters and well-structured event sequences.\nd. Utilize descriptive language to create a mood and tone appropriate to purpose, task, and audience.\ne. Use appropriate conventions and style for the audience, purpose, and task.\n Standard 7–8.W.4:\n Conduct short research projects to craft an argument, an -\nswer a question, or provide an analysis.\na. Gather, assess, and use information from credible sources on the topic.\nb. Generate ideas to demonstrate understanding of the topic and purpose. \nc. Avoid plagiarism by quoting, paraphrasing, and citing, using a standard format for citation of evidence.\nd. Interact and collaborate with others throughout the writing process.\n Standard 7–8.W.5:\n Mastered in grade 5."
    },
    {
      "page": 51,
      "text": "Strand 1:  SPEAKING AND LISTENING (9–10.SL)\nStudents will learn to collaborate, express and listen to ideas, integrate \nand evaluate information from various sources, use media and visual displays as well as language and grammar strategically to help achieve communicative purposes, and adapt to context and task.\n Standard 9–10.SL.1:\n Participate effectively in a range of conversations and col -\nlaborations on topics, texts, and issues.\na. Respond thoughtfully to diverse perspectives in demo -\ncratic discussions that involve decision-making and role-taking; synthesize comments, claims, and evidence.\nb. Participate in conversations by asking and responding to questions and provide the opportunity to consider a range of perspectives and clarify, verify, or challenge ideas and conclusions with evidence.\nc. Identify contradictions when applicable, and determine if additional information or research is required to deep -\nen the investigation or conversation. \n Standard 9–10.SL.2:\n Interpret and evaluate the credibility of multiple sources of \ninformation presented in various formats and mediums to solve problems and make informed decisions.\n Standard 9–10.SL.3:\n Use appropriate language, grammar, organization, devel -\nopment, and delivery styles appropriate to purpose and audience for formal or informal contexts.\na. Convey a clear perspective by concisely presenting and citing information, findings, and supporting evidence so that listeners can follow the line of reasoning.\nStrand 2:  READING (9–10.R)\nStudents will learn to proficiently read and comprehend grade-level literature and informational text, including seminal U.S. documents of historical and literary significance, at the high end of the grade-level text complexity band, with scaffolding as needed. *Standard R.4 includes an \nasterisk to refer educators back to the Text Complexity Grade Bands and As -\nsociated Lexile Ranges in the introduction of the standards."
    },
    {
      "page": 52,
      "text": " Standard 9–10.R.2:  Mastered in grade 3.\n Standard 9–10.R.3:  Mastered in grade 5.\n Standard 9–10.R.4:  Read grade-level text* with accuracy and fluency to sup -\nport comprehension. (RL & RI)\n Standard 9–10.R.5:  Cite relevant textual evidence to support analysis of what \nthe text says explicitly as well as what inferences can be \ndrawn from the text, including identifying where the text implies ambiguity. (RL & RI)\n Standard 9–10.R.6:\n  When reading texts, including those from diverse cultures, \ndetermine a theme, analyze its development in detail, including how it emerges and is shaped and refined by specific details; provide an objective summary that includes textual evidence. (RL) \nWhen reading texts, including those from diverse cultures, \ndetermine two or more main ideas, analyze the main ideas’ relationship to supporting ideas, and provide an objective summary that includes textual evidence. (RI) \n Standard 9–10.R.7:\n Analyze how plot elements and dialogue interact, shape \nthe characters, and propel the action. (RL) \nAnalyze how a text makes connections among and distinc -\ntions between individuals, ideas, or events through com -\nparisons, analogies, or categories. (RI)\n Standard 9–10.R.8:  Determine the meaning and impact of words and phrases \non meaning, tone, and mood. Analyze figurative language \nand connotative meanings. Examine domain-specific vo -\ncabulary and how language differs across genres and text types. (RL & RI)\n Standard 9–10.R.9:\n Determine or clarify the meaning of unknown and multiplemeaning words and phrases choosing flexibly from a range of strategies. (RL & RI)\na. Identify and correctly use patterns of word parts that indicate different meanings or parts of speech.\nb. Determine and consult appropriate reference materials to find the pronunciation of a word, its precise meaning, its part of speech, or its etymology including Greek or Latin affixes and roots."
    },
    {
      "page": 53,
      "text": "author uses in an exposition, argument, or narrative, in -\ncluding whether the structure makes points or events clear, \neffective, convincing, or engaging. (RL & RI)\n Standard 9–10.R.11:  Analyze how an author’s geographic location, identity or \nbackground, culture, and time period affect the perspec -\ntive, point of view, purpose, and implicit/explicit messages of a text. (RL & RI)\n Standard 9–10.R.12:\n Compare a text to another text in a different medium ana -\nlyzing the portrayal of the subject, evaluate the advantages and disadvantages of using the different mediums, and ex -\nplain how and why the content stays faithful to or departs from the text or script. (RL & RI)\n Standard 9–10.R.13:\n Not applicable to RL.\nDelineate and evaluate an argument and specific claims in a text, assessing the validity or fallacy of key statements by examining whether the supporting evidence is relevant and sufficient. Recognize when irrelevant evidence is intro -\nduced. (RI)\n Standard 9–10.R.14:\n Analyze two or more works of fiction with similar themes or \ntopics, drawing on patterns of events, characters types, and stylistic choices. (RL)\nAnalyze how two or more texts about the same topic shape \ntheir presentations by emphasizing different evidence or advancing different interpretations of facts; identify where the texts disagree on matters of fact or interpretation. (RI)\nStrand 3:  WRITING (9-10.W)\nStudents will learn to write for a variety of tasks, purposes, and audi -\nences using appropriate grammar/conventions, syntax, and style.\n Standard 9–10.W.1:\n Write arguments to support claims in an analysis of com -\nplex topics or texts using logical reasoning and relevant evidence, and provide a conclusion that follows from and supports the argument presented.\na. Introduce claims, distinguish the claims from alternate or opposing claims, and create an organization that establishes clear relationships among claims, counter -\nclaims, reasons, and evidence.\nb. Develop claims and counterclaims by supplying evidence"
    },
    {
      "page": 54,
      "text": "strengths and limitations that consider the audience.\nc. Use words, phrases, and clauses to link the major sec -\ntions of the text, create cohesion, and clarify the rela -\ntionships between claims and reasons, between reasons and evidence, and between claims and counterclaims. \nd. Use appropriate conventions and style for the audience, purpose, and task.\n Standard 9–10.W.2:\n Write informative/explanatory texts to examine and con -\nvey related ideas and information clearly and accurately through the effective selection, organization, and analysis of content, and provide a conclusion that follows from and supports the information or explanation presented. \na. Introduce a topic; organize related ideas and informa -\ntion to make important connections and distinctions; utilize formatting, graphics, and multimedia to show relationships.\nb. Develop the topic with relevant facts, extended defini -\ntions, concrete details, quotations, and examples.\nc. Use appropriate and varied transitions to link the major sections of the text, create cohesion, and clarify the rela -\ntionships among related ideas. \nd. Use precise language and content-specific vocabulary to clarify the relationships of the ideas.\ne. Use appropriate conventions and style for the audience, purpose, and task.\n Standard 9–10.W.3:\n Write narrative texts to develop real or imagined experi -\nences or events using effective technique, well-structured event sequences, well-chosen details, and provide a reso -\nlution that connects to what is experienced, observed, or resolved over the course of the narrative.\na. Engage and orient the reader by describing a problem, situation, or observation.\nb. Establish one or multiple point(s) of view, and introduce a setting, narrator and/or characters.\nc. Use narrative techniques such as dialogue, pacing, de -\nscription, reflection, and multiple plot lines, to develop characters and well-structured event sequences.\nd. Utilize varied syntax techniques and descriptive lan -\nguage to create a mood and tone appropriate to pur -\npose, task, and audience.\ne. Use appropriate conventions and style for the audience, purpose, and task."
    },
    {
      "page": 55,
      "text": "ment, answer a question, or provide an analysis.\na. Gather, assess, and synthesize information from cred -\nible sources on the topic.\nb. Reflect on the evidence and generate ideas to demon -\nstrate understanding of the topic and purpose.\nc. Avoid plagiarism by quoting, paraphrasing, and citing, \nusing a standard format for citation of evidence.\nd. Interact and collaborate with others throughout the writing process.\n Standard 9–10.W.5:\n Mastered in grade 5."
    },
    {
      "page": 56,
      "text": "Strand 1:  SPEAKING AND LISTENING (11–12.SL)\nStudents will learn to collaborate, express and listen to ideas, integrate \nand evaluate information from various sources, use media and visual displays as well as language and grammar strategically to help achieve communicative purposes, and adapt to context and task.\n Standard 11–12.SL.1:\n Participate effectively in a range of conversations and col -\nlaborations on topics, texts, and issues.\na. Respond thoughtfully to diverse perspectives in demo -\ncratic discussions that involve decision-making and role-taking; resolve claims and evidence.\nb. Participate in conversations by asking and responding to questions that examine reasoning and evidence, ensur -\ning the opportunity to consider a range of perspectives, and clarify, verify, or challenge ideas and conclusions with evidence.\nc. Resolve contradictions when applicable, and determine if additional information or research is required to deep -\nen the investigation or conversation. \n Standard 11–12.SL.2:\n Interpret, evaluate, and integrate multiple sources of in -\nformation presented in various formats and mediums to verify the credibility and accuracy of each source, and note any discrepancies among the data in order to make in -\nformed decisions.\n Standard 11–12.SL.3:\n Use appropriate language, grammar, organization, devel -\nopment, and delivery styles appropriate to purpose and audience for formal or informal contexts.\na. Strategically use visual displays of data and digital me -\ndia, to convey information and enhance understanding of presentations.\nStrand 2:  READING (11–12.R)\nStudents will learn to proficiently read and comprehend grade-level literature and informational text, including seminal U.S. documents of historical and literary significance, at the high end of the grade-level text complexity band, with scaffolding as needed. *Standard R.4 includes an"
    },
    {
      "page": 57,
      "text": "sociated Lexile Ranges in the introduction of the standards.\n Standard 11–12.R.1:  Mastered in preschool.\n Standard 11–12.R.2:  Mastered in grade 3.\n Standard 11–12.R.3:  Mastered in grade 5.\n Standard 11–12.R.4:  Read grade-level text* with accuracy and fluency to sup -\nport comprehension. (RL & RI)\n Standard 11–12.R.5:  Cite relevant textual evidence to support analysis of what \nthe text says explicitly as well as inferences drawn from \nthe text, including analyzing where the text implies ambi -\nguity. (RL & RI)\n Standard 11–12.R.6:  When reading texts, including those from diverse cul -\ntures, determine two or more themes and analyze their development, including how they interact and build on one another to produce a complex account, and provide an objective summary that includes textual evidence. (RL) \nWhen reading texts, including those from diverse cul -\ntures, determine main ideas of two or more texts, analyze \nthe main ideas, supporting details, and the relationship between/among the texts; provide an objective synthesis of the texts that includes textual evidence. (RI)\n Standard 11–12.R.7:\n Analyze how an author develops a text through complex \nand/or dynamic characters, interaction with other charac -\nters, and advancement of the plot or development of the theme. (RL)\nAnalyze how the author develops a text through an analy -\nsis or argument, including the sequence, the introduction \nand development and connections of ideas. (RI)\n Standard 11–12.R.8:\n Determine the meaning and impact of words and phrases \non tone and mood, including words with multiple mean -\nings. Analyze figurative language, connotative meanings, and figures of speech. Examine how the author uses and refines the meaning of domain-specific vocabulary and how language differs across historical time periods, cul -\ntures, regions, and genres. (RL & RI)\n Standard 11–12.R.9:\n Determine or clarify the meaning of unknown and multi -\nple-meaning words and phrases, choosing flexibly from a range of strategies. (RL & RI)"
    },
    {
      "page": 58,
      "text": "ent meanings or parts of speech.\nb. Determine and consult appropriate reference mate -\nrials, to find the pronunciation of a word, its precise \nmeaning, its part of speech, its etymology including Greek or Latin affixes and roots, and its usage.\n Standard 11–12.R.10:\n Analyze and evaluate the effectiveness of structures \nacross multiple texts about similar topics/themes, includ -\ning whether the structures make points or events clear, effective, convincing, or engaging. (RL & RI)\n Standard 11–12.R.11:\n Analyze how an author’s geographic location, identity or \nbackground, culture, and time period affect the perspec -\ntive, point of view, purpose, and implicit/explicit messages of a collective body of work. (RL & RI)\n Standard 11–12.R.12:\n Analyze how a subject and/or content is presented in \ntwo or more mediums by determining which details are emphasized, altered, or absent in each account and how these details influence audiences’ experiences and inter -\npretations. (RL & RI)\n Standard 11–12.R.13:\n Not applicable to RL.\nDelineate and evaluate arguments and specific claims across multiple texts on the same subject, assessing the validity or fallacy of key statements by examining wheth -\ner the supporting evidence is relevant and sufficient. Recognize when irrelevant evidence is introduced. (RI)\n Standard 11–12.R.14:\n Analyze two or more texts of literary significance across \nand within time periods with similar topics and themes, drawing on their purposes, stylistic choices, and rhetorical features. (RL)\nAnalyze and evaluate works of cultural significance for the \nway in which these works treat similar themes, conflicts, issues, or topics, and maintain relevance for current audi -\nences. (RI)\nStrand 3:  WRITING (11–12.W)\nStudents will learn to write for a variety of tasks, purposes, and audi -\nences using appropriate grammar/conventions, syntax, and style.\n Standard 11–12.W.1:\n Write arguments to support claims in an analysis of com -\nplex topics or texts, using logical reasoning and relevant,"
    },
    {
      "page": 59,
      "text": "from and supports the argument presented.\na. Introduce claims, establish the significance of the claims, distinguish the claims from alternate or oppos -\ning claims, and create an organization that logically se -\nquences claims, counterclaims, reasons, and evidence.\nb. Develop claims and counterclaims by interpreting the most relevant evidence from accurate, credible sourc -\nes for each; elaborate on the strengths and limitations that anticipate the audience. \nc. Use words, phrases, and clauses as well as varied syn -\ntax to link the major sections of the text, create cohe -\nsion, and clarify the relationships between claims and reasons, between reasons and evidence, and between claims and counterclaims.\nd. Use appropriate conventions and style for the audi -\nence, purpose, and task.\n Standard 11–12.W.2:  Write informative/explanatory texts to examine and con -\nvey complex ideas and information clearly and accurately through the effective selection, organization, and analysis of content, and provide a conclusion that follows from and supports the information or explanation presented.\na. Introduce a topic; organize complex ideas and infor -\nmation so that each new element builds on that which precedes it to create a unified whole; utilize formatting, graphics, and multimedia to illustrate complexities.\nb. Develop the topic thoroughly with relevant and suffi -\ncient facts, extended definitions, concrete details, quo -\ntations, examples, and figurative language.\nc. Use appropriate and varied transitions and syntax to link the major sections of the text, create cohesion, and clarify the relationships among complex ideas.\nd. Use precise language and content-specific vocabulary to clarify the complexity of the ideas.\ne. Use appropriate conventions and style for the audi -\nence, purpose, and task.\n Standard 11–12.W.3:  Write narrative texts to develop real or imagined experi -\nences or events using effective technique, well-structured event sequences, well-chosen details, and provide a reso -\nlution with closure.\na. Engage and orient the reader by describing a complex problem, situation, or observation. \nb. Establish one or multiple point(s) of view, and develop a setting, narrator and/or characters."
    },
    {
      "page": 60,
      "text": "description, reflection, flashback, and multiple plot lines to develop characters and well-structured event sequences.\nd. Utilize varied syntax techniques and descriptive lan -\nguage to create a mood and tone appropriate to pur -\npose, task, and audience.\ne. Use appropriate conventions and style for the audi -\nence, purpose, and task.\n Standard 11–12.W.4:  Conduct research projects to craft an argument, answer a \nquestion, or provide an analysis.\na. Gather, assess, and synthesize information from cred -\nible sources on the topic.\nb. Evaluate the evidence and generate ideas to demon -\nstrate understanding of the topic and purpose.\nc. Avoid plagiarism by quoting, paraphrasing, and citing, using a standard format for citation of evidence.\nd. Interact and collaborate with others throughout the writing process.\n Standard 11–12.W.5:\n Mastered in grade 5."
    },
    {
      "page": 61,
      "text": "This is a blank page."
    },
    {
      "page": 62,
      "text": "250 East 500 South  \nP .O. Box 144200\nSalt Lake City, UT 84114-4200 \nSydnee Dickson, Ed.D.\nState Superintendent of Public Instruction\nwww.schools.utah.gov"
    }
  ]
}